Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionPipeStandard.#ctor(System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double)
Creates a new instance of Structural Section Pipe Standard shape with the associated set of parameters,
used to attach to structural element.
diameter:
Pipe Diameter.
centroidHorizontal:
Distance from centroid to the left extremites along horizontal axis.
centroidVertical:
Distance from centroid to the upper extremites along vertical axis.
principalAxesAngle:
Rotation angle between the principal axes and cross section reference planes.
wallNominalThickness:
Represents wall nominal thickness of rectangle.
wallDesignThickness:
Represents wall design thickness of rectangle.
sectionArea:
Cross section area.
perimeter:
Painting surface of the unit length.
nominalWeight:
Unit weight (not mass) per unit length, for self-weight calculation or quantity survey.
momentOfInertiaStrongAxis:
Moment of Inertia about main strong axis (I).
momentOfInertiaWeakAxis:
Moment of Inertia about main weak axis (I).
elasticModulusStrongAxis:
Elastic section modulus about main strong axis for calculation of bending stresses.
elasticModulusWeakAxis:
Elastic section modulus about main weak axis for calculation of bending stresses.
plasticModulusStrongAxis:
Plastic section modulus in bending about main strong axis (Z, Wpl).
plasticModulusWeakAxis:
Plastic section modulus in bending about main weak axis.
torsionalMomentOfInertia:
Torsional Moment of inertia (J, IT, K), for calculation of torsional deformation.
torsionalModulus:
Section modulus for calculations of torsion stresses (Ct).
warpingConstant:
Warping constant (Cw, Iomega, H).
shearAreaStrongAxis:
Shear area (reduced extreme shear stress coefficient) in the direction of strong axis (Wq).
shearAreaWeakAxis:
Shear area (reduced extreme shear stress coefficient) in the direction of weak axis (Wq).
Since:
2015

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionPipeStandard
Defines parameters for pipes also known as RoundHSS or HollowStructuralSection (HSS).
Since:
2015